# GAP Beginner

A repository to introduce GAP system for beginners.

## Variable

```
universe := 6*7;
m:=[[1,2,3],[4,5,6],[7,8,9]];
```

##  `ColorPrompt()`

```
ColorPrompt(true);
```

## `LogTo()`

```
LogTo("gap-intro.log");
```

## `Display()`

```
Display(m);
```

## `Factorial()`

```
> Factorial(100);
93326215443944152681699238856266700490715968264381621468\
59296389521759999322991560894146397615651828625369792082\
7223758251185210916864000000000000000000000000
```

## `Determinant()`

```
> Determinant(m);
0
```

## `Factors()`

```
> Factors(2^64-1);
[ 3, 5, 17, 257, 641, 65537, 6700417 ]
```

## `Filtered()`

```
> Filtered( [2,9,6,3,4,5], IsEvenInt);
[ 2, 6, 4 ]
```

## `Fibonacci()`

```
> Fibonacci(100);
354224848179261915075
```

## `Group()`

```
> a:=(1,2,3);;b:=(2,3,4);;
> # Next, let G be a group generated by a and b:
> G:=Group(a,b);
Group([ (1,2,3), (2,3,4) ])
```

## `Size()`

```
> a:=(1,2,3);;b:=(2,3,4);;
> G:=Group(a,b);
> Size(G);
12
```

## `IsAbelian()`

```
> a:=(1,2,3);;b:=(2,3,4);;
> G:=Group(a,b);
> IsAbelian(G);
false
```
## `StructureDescription()`

```
> a:=(1,2,3);;b:=(2,3,4);;
> G:=Group(a,b);
> StructureDescription(G);
"A4"
```

## `Order()`

```
> a:=(1,2,3);;b:=(2,3,4);;
> Order(a);
3
```
